#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
data.aws_ami.amazon-linux-2023: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/flask-cluster/cluster]
aws_ecr_repository.ecr: Refreshing state... [id=flask]
aws_route53_zone.main: Refreshing state... [id=Z01840343VLFM40ST0EUE]
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c09170ef62951a18]
data.aws_caller_identity.current: Read complete after 0s [id=781156139953]
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
aws_iam_role.role2: Refreshing state... [id=eks-role]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20240124170717977100000001]
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=781156139953]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=flask-cluster-cluster-20240124170717982300000003]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=781156139953]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=781156139953]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::781156139953:assumed-role/gha_oidc_assume_role/terraformdeploy]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20240124170717977100000001-20240124170718349800000006]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20240124170717977100000001-20240124170718286500000005]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20240124170717977100000001-20240124170718267200000004]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=flask-cluster-cluster-20240124170717982300000003-20240124170718390800000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=flask-cluster-cluster-20240124170717982300000003-20240124170718377700000007]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3681786840]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=6cdac06c-6ad1-4313-9f34-8658dc8ace0b]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/flask-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::781156139953:policy/flask-cluster-cluster-ClusterEncryption2024012417073514930000000b]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=flask-cluster-cluster-20240124170717982300000003-2024012417073538730000000c]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06b3e69d5869bc29f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09af621a18b01bc94]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c570d1f61c35052c]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0bfe462ce4c66bf9e]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0d7f82c21a9e2c19f]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0d8a6ab0f6b17555f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ac2f58ddb7b3f238]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06de7b2372bbef930]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0ed95bbc69035dd63]
data.aws_ami.amazon-linux-2023: Read complete after 0s [id=ami-0bb6cbb99aec63c04]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0a9b3c53e4183ecad]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-038e853b7dde793dc]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04eb9bebec3aee9ac]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ac692623c11f2600]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0440435a64e12578d]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-09a63666be7ec59fc]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c566bb70d0d137df]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-03e1e424a93f762e1]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-023be07213544de76]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-004ee61dedec0e033]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0ed95bbc69035dd631080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06c413e34353dfaa6]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0283be17e013df87b]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-06bf33fd8cebf8801]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2774406440]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-4223916909]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3172596366]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-568164570]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-424040801]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-4033972792]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1165800209]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2380195085]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1042068715]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-847363323]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-030ee744481495cea]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-000e2b5ac652d97c1]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0bfe837edb5630919]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2300402249]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-018eaf885723d307a]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0db1100dda1dd8abb]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0cc78d4612a31b3f6]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-09a63666be7ec59fc1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c566bb70d0d137df1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-04eb9bebec3aee9ac1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=flask-cluster]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-01-24T17:19:49Z]
module.eks.aws_eks_identity_provider_config.this["sts"]: Refreshing state... [id=flask-cluster:sts]
module.eks.data.tls_certificate.this[0]: Reading...
data.aws_eks_cluster_auth.default: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
data.aws_eks_cluster_auth.default: Read complete after 0s [id=flask-cluster]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::781156139953:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75]
module.eks.module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-0b492fc74f726932b]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=flask-cluster:general-20240124171949621200000013]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=flask-cluster:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=flask-cluster:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=flask-cluster:vpc-cni]
module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.external_dns_irsa_role.aws_iam_policy.external_dns[0]: Refreshing state... [id=arn:aws:iam::781156139953:policy/AmazonEKS_External_DNS_Policy-20240124172829146700000001]
module.cert_manager_irsa_role.aws_iam_policy.cert_manager[0]: Refreshing state... [id=arn:aws:iam::781156139953:policy/AmazonEKS_Cert_Manager_Policy-20240124172829149800000002]
module.external_dns_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=external-dns]
module.cert_manager_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=cert-manager]
module.external_dns_irsa_role.aws_iam_role_policy_attachment.external_dns[0]: Refreshing state... [id=external-dns-20240124172829446400000004]
module.cert_manager_irsa_role.aws_iam_role_policy_attachment.cert_manager[0]: Refreshing state... [id=cert-manager-20240124172829412300000003]
kubernetes_service_account.dns-account: Refreshing state... [id=kube-system/external-dns]
kubernetes_service_account.cert-account: Refreshing state... [id=kube-system/cert-manager]
helm_release.external_dns: Refreshing state... [id=external-dns]
helm_release.cert-manager: Refreshing state... [id=cert-manager]
helm_release.nginx-ingress: Refreshing state... [id=nginx-ingress-controller]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role.role2 will be updated in-place
  ~ resource "aws_iam_role" "role2" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::781156139953:user/cloud_user" -> "arn:aws:iam::781156139953:root"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "eks-role"
        name                  = "eks-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.cert_manager_irsa_role.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.cert_manager_irsa_role.data.aws_iam_policy_document.cert_manager[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cert_manager" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "route53:GetChange",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "route53:ChangeResourceRecordSets",
              + "route53:ListResourceRecordSets",
            ]
          + resources = [
              + "arn:aws:route53:::hostedzone/Z01840343VLFM40ST0EUE",
            ]
        }
      + statement {
          + actions   = [
              + "route53:ListHostedZonesByName",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.cert_manager_irsa_role.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cert-manager",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::781156139953:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cert_manager_irsa_role.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.cert_manager_irsa_role.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.cert_manager_irsa_role.aws_iam_policy.cert_manager[0] will be updated in-place
  ~ resource "aws_iam_policy" "cert_manager" {
        id          = "arn:aws:iam::781156139953:policy/AmazonEKS_Cert_Manager_Policy-20240124172829149800000002"
        name        = "AmazonEKS_Cert_Manager_Policy-20240124172829149800000002"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:GetChange"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::change/*"
                    },
                  - {
                      - Action   = [
                          - "route53:ListResourceRecordSets",
                          - "route53:ChangeResourceRecordSets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/Z01840343VLFM40ST0EUE"
                    },
                  - {
                      - Action   = "route53:ListHostedZonesByName"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.cert_manager_irsa_role.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75:sub" = "system:serviceaccount:kube-system:cert-manager"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::781156139953:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "cert-manager"
        name                  = "cert-manager"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.external_dns_irsa_role.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.external_dns_irsa_role.data.aws_iam_policy_document.external_dns[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "external_dns" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "route53:ChangeResourceRecordSets",
            ]
          + resources = [
              + "arn:aws:route53:::hostedzone/Z01840343VLFM40ST0EUE",
            ]
        }
      + statement {
          + actions   = [
              + "route53:ListHostedZones",
              + "route53:ListResourceRecordSets",
              + "route53:ListTagsForResource",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.external_dns_irsa_role.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:external-dns",
                ]
              + variable = "oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::781156139953:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.external_dns_irsa_role.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.external_dns_irsa_role.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.external_dns_irsa_role.aws_iam_policy.external_dns[0] will be updated in-place
  ~ resource "aws_iam_policy" "external_dns" {
        id          = "arn:aws:iam::781156139953:policy/AmazonEKS_External_DNS_Policy-20240124172829146700000001"
        name        = "AmazonEKS_External_DNS_Policy-20240124172829146700000001"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:ChangeResourceRecordSets"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/Z01840343VLFM40ST0EUE"
                    },
                  - {
                      - Action   = [
                          - "route53:ListTagsForResource",
                          - "route53:ListResourceRecordSets",
                          - "route53:ListHostedZones",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.external_dns_irsa_role.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::781156139953:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/A6409278AF3D182885277A081A867F75"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "external-dns"
        name                  = "external-dns"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @eevlogiev, Action: `pull_request`*